Обработки/Reports/_СписокЛицВходящихВПеречень.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Report>
		<Properties>
			<Name>_СписокЛицВходящихВПеречень</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>v8:StandardPeriod</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресХранилищаXMLММВБ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПеречня</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыПеречнейОбъектов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НовыйФормат</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоказатьУволенных</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

Обработки/Reports/_СписокЛицВходящихВПеречень/Forms/ФормаОтчета/Ext/Form/Module.bsl
#Область Обработчики_событий_формы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Отчет.Организация = ОбщегоНазначения.ЗначениеПараметраСеанса("ТекущаяОрганизация");
	Отчет.НовыйФормат = Истина;
	
	РаботаСФормами.УстановитьВерсиюДополнительногоОтчетаОбработки(ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	РаботаСФормами.ПриЗагрузкеДанныхИзНастроек(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	НастроитьВидимостьДоступность(ЭтаФорма);

КонецПроцедуры


#КонецОбласти 

#Область Обработчики_событий_элементов_формы

&НаКлиенте
Процедура ВидПеречняПриИзменении(Элемент)
	
	НастроитьВидимостьДоступность(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура РезультатОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка, ДополнительныеПараметры)
	
	Если ТипЗнч(Расшифровка) = Тип("СписокЗначений") Тогда
		СтандартнаяОбработка = Ложь;
		
		ВыбранноеЗначение = Расшифровка.ВыбратьЭлемент();
		Если ВыбранноеЗначение <> Неопределено Тогда
			ОткрытьЗначение(ВыбранноеЗначение.Значение);
		КонецЕсли;	
		
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти 

#Область Обработчики_Команд

&НаКлиенте
Процедура СформироватьОтчет(Команда)
	
	Если ЭтаФорма.ПроверитьЗаполнение() Тогда
	
		СформироватьОтчетНаСервере();
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СформироватьОтчетНаСервере()
	
	РеквизитОтчет  = РеквизитФормыВЗначение("Отчет");
	РеквизитОтчет.СформироватьОтчет(ЭтаФорма.Результат, ЭтаФорма.УникальныйИдентификатор);
	ЗначениеВРеквизитФормы(РеквизитОтчет, "Отчет");
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьXML(Команда)
	
	ОчиститьСообщения();
	
	Если ЭтоАдресВременногоХранилища(Отчет.АдресХранилищаXMLММВБ) Тогда
		ДанныеХранилища = ПолучитьИзВременногоХранилища(Отчет.АдресХранилищаXMLММВБ);
	Иначе
		ДанныеХранилища = Неопределено;
	КонецЕсли;
	
	Если ДанныеХранилища = Неопределено Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Отчёт не сформирован");
		
	ИначеЕсли ТипЗнч(ДанныеХранилища) = Тип("Массив") Тогда
		
		Для Каждого ОписаниеОшибки Из ДанныеХранилища Цикл
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки);
		КонецЦикла;
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("После устранения ошибок сформируйте отчёт заново");
		
	Иначе
		
		Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение);
		Диалог.Фильтр				= "xml файл (*.xml)|*.xml";
		Диалог.ПолноеИмяФайла		= Формат(Отчет.Период.ДатаОкончания, "ДФ='''insiders''-yyyy-MM-dd.''xml'''");
		Диалог.МножественныйВыбор	= Ложь; 
		Диалог.Заголовок			= "Список инсайдеров:"; 
		
		Если Диалог.Выбрать() Тогда 
			ДанныеХранилища.Записать(Диалог.ПолноеИмяФайла);
		КонецЕсли;
		
	КонецЕсли;
		
	
КонецПроцедуры

#КонецОбласти 

#Область Служебные_процедуры_и_функции

&НаКлиентеНаСервереБезКонтекста
Процедура НастроитьВидимостьДоступность(Форма)
	
	Отчет	 = Форма.Отчет;
	Элементы = Форма.Элементы;
	
	ВидыПеречнейОбъектов = РаботаСМетаданнымиПовтИсп.ЗначенияПредопределенныхЭлементовСправочникаВСтруктуру("ВидыПеречнейОбъектов");
	ВидыИзмененийПеречней = РаботаСМетаданнымиПовтИсп.ЗначенияПеречисленияВСтруктуру("ВидыИзмененийПеречней");
	
	Элементы.ФормаСохранитьXML.Видимость = (Отчет.ВидПеречня = ВидыПеречнейОбъектов.Инсайдеры);
	Элементы.Ответственный.Видимость	 = (Отчет.ВидПеречня = ВидыПеречнейОбъектов.Инсайдеры);
	
	Элементы.ПоказатьУволенных.Видимость = НЕ (Отчет.ВидПеречня = ВидыПеречнейОбъектов.Инсайдеры);

КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	ТекстСообщения = "";

	Если Не ОбщегоНазначенияКлиентСервер.ПериодЗаполненКорректно(Отчет.Период,,, ТекстСообщения) Тогда 
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,, "Отчет.Период", Отказ);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
